<template>
  <div>
    <h1>更新日誌</h1>
    <h2>2022-11-23</h2>
    <ul>
      <li>新增退選率 API 供查詢。</li>
    </ul>
    <h2>2022-10-05</h2>
    <ul>
      <li>尋找空教室支援了星期選擇功能。</li>
    </ul>
    <h2>2022-10-03</h2>
    <ul>
      <li>現在課程資料會自動儲存在瀏覽器中了！除了能夠帶來高速的讀取速度，重新整理時也無需下載新資料了。</li>
      <li>修正了重複點擊課程標準中相同科系時，造成的錯誤。</li>
      <li>修正了一些錯字。</li>
    </ul>
    <h2>2022-09-28</h2>
    <ul>
      <li>重新設計的課表
        <ul>
          <li>顯示更多有用資訊</li>
          <li>自動合併連堂課程</li>
          <li>課表將依據課程進行動態調整</li>
        </ul>
      </li>
    </ul>
    <h2>2022-09-27</h2>
    <ul>
      <li>「退選率」現在預設會抓取十個學期的資料</li>
    </ul>
    <h2>2022-09-19</h2>
    <ul>
      <li>新增了「新增到行事曆」自訂區間選項</li>
      <li>於「課程頁面」瀏覽器標題中新增了課號</li>
      <li>修正了接下來的課程排序</li>
    </ul>
    <h2>2022-09-17</h2>
    <ul>
      <li>現在使用「博雅課程」搜尋頁面時，可以透過類別篩選課程了。</li>
    </ul>
    <h2>2022-08-31</h2>
    <ul>
      <li>現在使用「課程標準」工具時，會自動儲存上次的位置了。</li>
    </ul>
  </div>
</template>
<script>
export default {

  head() {
    return {
      title: '更新日誌'
    }
  },
}
</script>